namespace Assets.Scripts.Locations
{
    public struct LocationFinishQuestText
    {
        public static readonly string PlayAreaText = "Место, где мы познакомились. Проходя мимо одинокой девочки, " +
            "качающейся на качелях с книжкой в руках, я сразу обратил на неё внимание. Внешне она ничем не отличалась от " +
            "других девчонок её возраста, но её заливистый смех сразу же запал мне в душу.";

        public static readonly string CinemaText = "Эмили обожала кино. Она тащила меня в кинотеатр при каждой удобной " +
            "возможности. Находясь здесь, я представляю, как бы она отреагировала ну ту, или иную сцену. Как будто смотрю " +
            "фильм её глазами.";

        public static readonly string CircusText = "На одном из представлений, я обратил внимание на свою супругу. " +
            "Эмили наблюдала за происходящим с серьёзным и сосредоточенным лицом. В тот день она мне призналась, что до жути " +
            "боится клоунов, и ходит в цирк чтобы бороться со своими страхами.";

        public static readonly string ParkText = "Любимое место Эмили в нашем городе. Громкая музыка, разнообразные " +
            "аттракционы и розовая сладкая вата делали эту девушку самой счастливой на свете. Она будто растворялась в этом " +
            "потоке веселья и восторга, становилась его частью.  ";

        public static readonly string PlanetariumText = "Космос мало интересовал мою жену. Зато он приводил в восторг меня. " +
            "Я с большим удовольствием пересказывал Эми мифы звездного неба. Она со скукой выслушивала мои " +
            "россказни о безжизненных небесных телах, но она видела, что мне это интересно, и радовалась за меня.";

        public static readonly string ConcertHallText = "Изначально классическая музыка нравилась только мне, а Эмили " +
            "предпочитала современные мотивы, но с каждым походом на концерт, она проникалась ей всё больше и больше. " +
            "В последние разы, мне даже уговаривать её не приходилось, сама покупала нам билеты в первых рядах.";

        public static readonly string PetShopText = "Не знаю почему, но в магазине животных мне всегда становится как-то легче." +
            "Купил немного корма для животных, пусть будет...";

        public static readonly string DockText = "Рыбалка отвлекла меня от грустных мыслей и подарила приятные эмоции.";
    }
}
